#include <cstdlib>
#include <ctime>
#include "random.h"

// Some random text data collected from DIT LISTS
namespace Database{
	const std::string Names[10]={"izambo", "errikos", "spyros", "nikosPerdikopanis", "alexkalts", 
	"vaggelisd", "pstamat", "harry", "stef", "sdi1800164"};

	const std::string Subjects[40]={"Αντικειμενοστραφής Προγραμματισμός", "Πρώτη Άσκηση", "Δεύτερη Άσκηση",
	"Εργαστήρια", "Εκφώνηση και Διαδικαστικά Θέματα", "Σφάλμα κατά την εισαγωγή header file",
	"Κείμενο του Post", "Τυχαία εκτύπωση των Post", "Παράταση", "Που παραδίδουμε την άσκηση;",
	"Αριθμητικό αναγνωριστικό posts", "Titles and Subjects", "Posts", "Ημερομηνία δημιουργίας",
	"Σχετικά με την δημιουργία thread Κανόνες κλπ", "Κατά τη δημιουργία ενός post", "main",
	"Ονόματα δημιουργών", "Τύπος δεδομένων threads/posts", "Κομματιασμα ασκησης σε αρχεια",
	"Μοντελοποίηση λίστας", "Random number gen επιστρεφει την ιδια τιμη.", "Destuctors των posts",
	"Διαγραφή/Εκτύπωση threads", "Δυναμική δέσμευση αντικειμένων", "Δυναμική δεσμευση-Μεγεθος-Αριθμος posts/threads.",
	"Διαφορετικές κλάσεις για Forum/threads/posts", "Static arrays", "Χρήση δομών δεδομένων STL",
	"Σύνθεση κλάσεων", "Εισαγωγή posts και threads", "Private μεταβλητές", "Ορισμός αντικειμένων",
	"τύπος δεδομένου κειμένου και διαμορφωση ID", "Constructor σε άλλο αντικείμενο", "Σειρά δημιουργίας",
	"Τυχαίο segfault", "Εκχώρηση δεδομένων στα στοιχεία του forum", "Stack smashing", "Διευκρινηση για Σημειωση 3"};

	const std::string Text[20]={"Η προθεσμία παράδοσης της Πρώτης Ομάδας Ασκήσεων (Ασκήσεις 1 και 2) μετατίθεται για την Παρασκευή 13/12, 23:59.",
	"Οι εκφωνήσεις των ασκήσεων της Α Ομάδας (Πρώτη Ασκηση και Δεύτερη Ασκηση) βρίσκονται στο http://www.di.uoa.gr/~izambo/OOPassgn1_2020.pdf",
	"Το παραδοτέο θα πρέπει να περιλαμβάνει ένα αρχείο κειμένου με όνομα README στο οποίο να δίνετε: 1. την εντολή για τη μεταγλώττιση του προγράμματος, 2. πληροφορίες και αιτιολογήσεις σχετικά με τις σχεδιαστικές επιλογές σας, π.χ. για τις αναπαραστάσεις δεδομένων, για τις επιλογές κλάσεων, επιλογές ορατότητας μελών κλάσεων κ.λ.π.",
	"Κατά τη βαθμολόγηση, θα δοθεί ιδιαίτερη έμφαση στην περιγραφή των πληροφοριών των σχεδιαστικών επιλογών όπως θα περιγράφονται στο αρχείο README.",
	"Η διαδικασία παράδοσης περιγράφεται στο http://www.di.uoa.gr/~izambo/oop_submission1.html.",
	"Σύμφωνα με το νέο Πρόγραμμα Προπτυχιακών Σπουδών, το μάθημα Κ10-«Αντικειμενοστραφής Προγραμματισμός» συμπεριλαμβάνει 2 ώρες εργαστηρίου.",
	"Καλούνται οι φοιτητές που πρόκειται να δηλώσουν το μάθημα να εγγραφούν στο τμήμα που τους εξυπηρετεί κάνοντας post στο νήμα του αντίστοιχου εργαστηρίου, όταν αυτό ανοίξει. Θα τηρηθεί σειρά προτεραιότητας ως εξής: προηγούνται οι φοιτητές με έτος πρώτης εγγραφής 2018-19.",
	"Μεταξύ τους, η σειρά θα προκύψει από τη σειρά που προκύπτει από τα posts εγγραφής. Ακολουθούν οι φοιτητές με έτος πρώτης εγγραφής 2017-18 και πάλι μεταξύ τους η σειρά θα προκύψει από τη σειρά που προκύπτει από τα posts εγγραφής. Στη συνέχεια, οι φοιτητές με έτος πρώτης εγγραφής 2016-17 με αντίστοιχο τρόπο κ.ο.κ.",
	"Παρακαλείσθε να δηλώνετε συμμετοχή σε ένα μόνο τμήμα εργαστηρίου.",
	"Αν για κάποιο λόγο θέλετε να αλλάξετε την επιλογή σας, παρακαλείσθε να κάνετε επεξεργασία στο παλαιό μήνυμα, ακυρώνοντας τη συμμετοχή.",
	"Με αφορμή αυτό το μήνυμα, παρακαλείστε να δηλώνετε συμμετοχή με τον λογαριασμό σας και όχι δι'αντιπροσώπων.",
	"Σε περίπτωση που έχετε κάποιο πρόβλημα με την ενεργοποίηση του λογαριασμού σας, μπορείτε να απευθυνθείτε σε κάποιον διαχειριστή.",
	"Όσοι φοιτητές είχαν εγγραφεί και δεν μπορούσαν να γράψουν μήνυμα στο φόρουμ, παρακαλούνται να δοκιμάσουν ξανά.",
	"Σε περίπτωση που έχετε κάνει εγγραφή και παρ' όλ' αυτά συνεχίζετε να μην μπορείτε να γράψετε μήνυμα, παρακαλείστε να ελέγξετε τα e-mail σας για το μήνυμα επιβεβαίωσης που σας στάλθηκε κατά την εγγραφή σας.",
	"Την εβδομάδα 9-11/12/2019, στο τέλος των εργαστηρίων, θα διεξαχθούν οι ενδιάμεσες αξιολογήσεις (test) των φοιτητών.",
	"Για τους φοιτητές που έχουν παρακολουθήσει στο παρελθόν το Εργαστήριο, δηλαδή με έτος εισαγωγής 2017 και πριν, η αξιολόγηση θα διεξαχθεί την Τρίτη 10/12/2019, ώρα 7μ.μ. στην αίθουσα Β.",
	"Την εβδομάδα 18-20/11/2019 στο τέλος των Eργαστηρίων θα διεξαχθούν ενδιάμεσες αξιολογήσεις (test) των φοιτητών.",
	"Καλούνται όσοι έχουν παρακολουθήσει στο παρελθόν το Εργαστήριο και σκοπεύουν να εξεταστούν στο μάθημα στο τέλος του εξαμήνου να δηλώσουν εδώ συμμετοχή στην 1η ενδιάμεση αξιολόγηση, μέχρι Δευτέρα 18/11/2019, 24:00 τοπική ώρα.",
	"Η ημερομηνία και ώρα εξέτασης όσων δηλώσουν εδώ θα ανακοινωθεί άμεσα",
	"Δηλώνω συμμετοχή στην 1η ενδιάμεση αξιολόγηση." };
}


// Set the starting seed with time so its different each time the program runs
static int seed=time(NULL);

std::string randomName(void){
	srand(seed++);
	return Database::Names[ rand()%10 ];
}

std::string randomPhrase(void){
	srand(seed++);
	return Database::Subjects[ rand()%40 ];
}

std::string randomText(void){
	srand(seed++);
	return Database::Text[ rand()%20 ];

}
